<?php
$bookdata =<<<HTML
　　东胜神洲，傲来国，花果山巅。&lt;br /&gt;
&lt;img src=&quot;bookimages/20130701073306_19761.jpg&quot; width=&quot;300&quot; height=&quot;438&quot; alt=&quot;&quot; /&gt;&lt;br /&gt;
　　一片桃花的玉瓣自枝上旋转飘落，在空中打了几个转，落在了一只猴子的手中。&lt;br /&gt;
&lt;br /&gt;
　　这猴子用不十分灵活的手指捻起这片花瓣，凑到鼻前闻了闻，一股清香若有若无，猴子皱了皱眉，一双大大的眼睛如闪亮的星星，孩童般清澈无邪。&lt;br /&gt;
&lt;br /&gt;
　　他便盯着这花瓣，仿佛这花瓣是情人的红唇，从正午，直到黄昏。&lt;br /&gt;
&lt;br /&gt;
　　终于，这花瓣开始萎缩、干瘪，毫不掩饰的失望在猴子脸上呈现了出来，他抬头看了看天，又低头看了看地，终于站起身来，向山下奔去。&lt;br /&gt;
&lt;br /&gt;
　　而那花瓣，自山顶缓缓飘落，坠入山间的一条潺潺溪水中，随波逐流。&lt;br /&gt;
&lt;br /&gt;
　　头顶的是天，脚下的是地，这是树木，这是丛林，溪水，鲜果，青草，荆棘，岩石……那一群嬉笑打闹的，和我长得一模一样的，可是许多个我？&lt;br /&gt;
&lt;br /&gt;
　　一只猴子望着一群猴子，脚步放缓了下来；一群猴子望着一只猴子，指指点点，吱吱怪叫。&lt;br /&gt;
&lt;br /&gt;
　　“过来啊！”一只高大的猴子叫道。&lt;br /&gt;
&lt;br /&gt;
　　“为什么要过去呢？”猴子说。&lt;br /&gt;
&lt;br /&gt;
　　“我们都是猴子，要在一起啊！”&lt;br /&gt;
&lt;br /&gt;
　　“原来我是一只猴子……那么，什么是在一起呢？”&lt;br /&gt;
&lt;br /&gt;
　　“在一起……就是……就是不分开。”高大的猴子答道。&lt;br /&gt;
&lt;br /&gt;
　　“就是和你们一样，离得那么近吗？”猴子问。&lt;br /&gt;
&lt;br /&gt;
　　“对的对的。”高大的猴子扔过去一只鲜桃叫道，“我叫阿飞，这个桃子送你吃了。”&lt;br /&gt;
&lt;br /&gt;
　　猴子接过鲜桃，不明所以。&lt;br /&gt;
&lt;br /&gt;
　　“很好吃的。”阿飞叫道。&lt;br /&gt;
&lt;br /&gt;
　　猴子拿起鲜桃，试着咬了一口，艳红的汁水四溅，胸前的毛发上多了许多点点滴滴的露珠。“它喜欢被我们吃吗？”猴子问。&lt;br /&gt;
&lt;br /&gt;
　　阿飞咧咧嘴，像是在笑：“我只知道我喜欢吃它，哪里管它是不是喜欢被吃？”&lt;br /&gt;
&lt;br /&gt;
　　猴子看着手中多了一道齿痕的鲜桃，像受了伤，像流了血，突然，猴子有些恨自己，为什么要咬上这一口呢？不过，味道还真是……鲜美啊！&lt;br /&gt;
&lt;br /&gt;
　　“你叫什么名字？”阿飞问道。&lt;br /&gt;
&lt;br /&gt;
　　猴子含着桃子怔住：“我还没有名字。”&lt;br /&gt;
&lt;br /&gt;
　　“我们都有名字，我叫阿飞，那个是阿宝，那个是小天……”阿飞一一介绍。&lt;br /&gt;
&lt;br /&gt;
　　一股道不明的情绪在猴子心中蔓延开来，很不舒服的感觉，这是……悲伤？仿佛有一个声音在猴子脑中响起。是谁？谁在为我诠释悲伤的定义？&lt;br /&gt;
&lt;br /&gt;
　　自然无人应答。&lt;br /&gt;
&lt;br /&gt;
　　物以类聚，众猴纷纷围到了猴子跟前，一只小猴说：“你是从石头里蹦出来的，我看见了。”猴子挠挠脑袋，他自己也不知道此身来自何处。&lt;br /&gt;
&lt;br /&gt;
　　阿飞露出了一个郑重的表情，显得有些滑稽，道：“就叫你石猴吧。”&lt;br /&gt;
&lt;br /&gt;
　　猴子咬了一口桃子，喃喃道：“石猴……石猴，这算是名字吗？”&lt;br /&gt;
&lt;br /&gt;
　　一只老猴道：“你若答应，就算是名字了。”&lt;br /&gt;
&lt;br /&gt;
　　“好吧，石猴就石猴。”猴子心中又一股奇妙的感觉升起，石猴，这称呼怎么如此熟悉？&lt;br /&gt;
&lt;br /&gt;
　　“那我叫了。”阿飞美滋滋道，他还是第一次给别的猴子取名字，在猴群中，一般只有几只老猴才有这个权力。&lt;br /&gt;
&lt;br /&gt;
　　“石猴！”阿飞喊道。&lt;br /&gt;
&lt;br /&gt;
　　猴子恍若未闻，不知在想着什么。&lt;br /&gt;
&lt;br /&gt;
　　“石猴！石猴！”阿飞又大声叫道，猴子还是不答。&lt;br /&gt;
&lt;br /&gt;
　　一只小猴小声道：“他怎么了？”&lt;br /&gt;
&lt;br /&gt;
　　阿飞有点羞怒，第一次给人家取名字，人家却不理他。他扬起毛茸茸的手臂，道：“这猴子有点耳背，我们一起喊。”&lt;br /&gt;
&lt;br /&gt;
　　十几只猴子齐声叫道：“石猴！石猴！石猴……”&lt;br /&gt;
&lt;br /&gt;
　　猴子的脑袋里轰然一声巨响，他闭上眼睛，思绪穿越万水千山，跨过无数往生岁月，回到了那曾经为人的一世……&lt;br /&gt;
&lt;br /&gt;
　　时侯，是自己前世的名字。爸爸姓时，妈妈姓侯，这个有歧义的名字便自然而然地应运而生了。&lt;br /&gt;
&lt;br /&gt;
　　时侯是学表演专业的，家里五代经商，便在海外也称得上是巨富，但他与那些只知道飙车勾女的富二代们不同，读书做事极为认真。&lt;br /&gt;
&lt;br /&gt;
　　国内那个尽人皆知的导演，姓张，以拍摄金氏作品著称，近年又转攻古典名著系列，第一要拍的便是《西游记》。&lt;br /&gt;
&lt;br /&gt;
　　时侯的母亲一心想让孩子进入娱乐界，时家就是不缺钱，硬生生用银子铺路，给时侯买了一个孙悟空的角色。&lt;br /&gt;
&lt;br /&gt;
　　时侯对母亲的做法非常不以为然，他对张氏导演的作品从来都是不屑一顾，但自己偏偏又极爱《西游》，几经考虑之下，便应了母亲。&lt;br /&gt;
&lt;br /&gt;
　　《西游记》这本书，时侯小时候便已翻了无数遍，里面的人物无论大小，他都如数家珍。这次为了准备角色，他又将这本经典巨著从头到尾看了几遍。&lt;br /&gt;
&lt;br /&gt;
　　拿到剧本后，时侯度过了有生以来最失落的一天，这剧本简直烂到了极点。时侯看了之后不禁发问：还能再烂一点吗？&lt;br /&gt;
&lt;br /&gt;
　　插科打诨恶搞穿帮是整个剧本的主题，单看剧情，时侯无论如何也看不出这居然就是自己心中的《西游记》。&lt;br /&gt;
&lt;br /&gt;
　　扔下剧本，时侯打开电脑，给编剧发了一封电邮：&lt;br /&gt;
&lt;br /&gt;
　　此版本《西游记》过于正统，在下恐难胜任。&lt;br /&gt;
&lt;br /&gt;
　　如将剧本按照下面的模式修改，我情愿饰演其中任一角色。&lt;br /&gt;
&lt;br /&gt;
　　在三国时期，唐僧师徒奉孙权之命，从东吴到西蜀取经；途中遇梁山好汉剪径，所幸黛玉拔刀相救。为此，唐僧与黛玉产生了一段旷世缠绵的爱情，与黛玉青梅竹马的宝玉跑去找唐僧算账，被城管打死，转世为孔明，主政西蜀，掌管真经……如此一来，将四大名著一网打尽，跨越时空与伦理，挑战逻辑与世俗，岂不快哉？&lt;br /&gt;
&lt;br /&gt;
　　发完邮件，时侯摇头笑了笑，自己又何必与人家怄气，在这个年代，再烂的作品都有无数拥趸，管他呢。&lt;br /&gt;
&lt;br /&gt;
　　时侯将这份无数人求之不得的剧本撕成了粉碎，然后拿起电话打给了妈妈：“这个角色我不演了。”时侯能想到电话那头妈妈错愕的表情，但他仍未作解释，挂掉，关机。&lt;br /&gt;
&lt;br /&gt;
　　任何一部影视作品都要尊重原著，这是起码的良心，时侯一直这样认为。不过，《西游记》嘛，恐怕读懂的人也不太多。86版的《西游记》连续剧他也看过，从质量上来说，勉强算得上形似罢了，唯一可取的便是剧组上下都用了心，仅从这点来看，不可诟病，也算对大家劳动的一种尊重吧。&lt;br /&gt;
&lt;br /&gt;
　　至于《西游记》中无数明线暗线，隐语谶语，权力之争，谋略的较量，恐怕用其他艺术形式难以表现吧。&lt;br /&gt;
&lt;br /&gt;
　　吴承恩，若真是靠着一人之力作成的《西游》，称他是神也不为过了。时侯想着想着，又拿起了《西游记》，一会便入了神。&lt;br /&gt;
&lt;br /&gt;
　　诗曰：&lt;br /&gt;
&lt;br /&gt;
　　混沌未分天地乱，茫茫渺渺无人见。&lt;br /&gt;
&lt;br /&gt;
　　自从盘古破鸿蒙，开辟从兹清浊辨。&lt;br /&gt;
&lt;br /&gt;
　　覆载群生仰至仁，发明万物皆成善。&lt;br /&gt;
&lt;br /&gt;
　　欲知造化会元功，须看西游齐天传……&lt;br /&gt;
&lt;br /&gt;
　　什么？西游齐天传？&lt;br /&gt;
&lt;br /&gt;
　　这最后两句，明明是“欲知造化会元功，须看西游释厄传。”释厄，原为化解磨难之意，怎么自己手中这本，变成了“齐天”？&lt;br /&gt;
&lt;br /&gt;
　　时侯，带着巨大的疑惑继续翻了下去，粗略看了几页，他唇角露出一丝发自内心的微笑，自语道：“这才是我的西游……”&lt;br /&gt;
&lt;br /&gt;
　　话音未落，时侯的身形化作一道白光，钻入了这本厚厚的《西游记》中……&lt;br /&gt;
&lt;br /&gt;
　　“不要，我还没看完——”时侯的声音在房间内戛然而止。&lt;br /&gt;
HTML;

$bookInfo = array(
	'title'       => 'ZCOM图书测试',
	'creator'     => '温成毅先生',
	'subject'     => 'wendoscoo',
	'description' => '中文测试，看到请回复',
	'publisher'   => 'wendoscoo',
	'contributor' => 'wendoscoo',
	'date'        => date('Y-m-d'),
	'type'        => 'wendoscoo',
	'format'      => 'wendoscoo',
	'source'      => 'xxxooo',
	'language'    => 'zh-cn',
	'relation'    => '',
	'coverage'    => '',
	'rights'      => 'zBook.EpubMaker'
);

$bookCover = 'bookCover.jpg';

$data = array(
	'1.第一章节'=>'东胜神洲，傲来国，花果山巅。&lt;br /&gt;
&lt;br /&gt;
　　一片桃花的玉瓣自枝上旋转飘落，在空中打了几个转，落在了一只猴子的手中。&lt;br /&gt;',
	'2.第二章节'=>'这猴子用不十分灵活的手指捻起这片花瓣，凑到鼻前闻了闻，一股清香若有若无，猴子皱了皱眉，一双大大的眼睛如闪亮的星星，孩童般清澈无邪。&lt;br /&gt;
&lt;br /&gt;
　　他便盯着这花瓣，仿佛这花瓣是情人的红唇，从正午，直到黄昏。&lt;br /&gt;
&lt;br /&gt;',
	'3.有图片的章节'=>$bookdata
);

